9/data/attachments/ba3507e288d74a85.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>James_camera_Friend_24685_8</nif:username>
            <nif:friendToBeRequested>soap_friends_9a7ccd03-c2bd-49fd-8296-74a569e46d08</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>